import React from "react";
import styled from "styled-components";

function AzYashir({size}) {
    return(
        <Container>
            <Heading>אָז יָשִׁיר</Heading>
            <Text fontSize={size}>
            וַיּֽוֹשַׁע יְהֹוָה בַּיּוֹם הַהוּא אֶת־יִשְׂרָאֵל מִיַּד מִצְרָֽיִם וַיַּרְא יִשְׂרָאֵל אֶת־מִצְרַֽיִם מֵת עַל־שְׂפַת הַיָּם: וַיַּרְא יִשְׂרָאֵל אֶת־הַיָּד הַגְּ֒דֹלָה אֲשֶׁר עָשָׂה יְהֹוָה בְּמִצְרַֽיִם וַיִּירְ֒אוּ הָעָם אֶת יְהֹוָה וַיַּאֲמִֽינוּ בַּיהוָֹה וּבְמשֶׁה עַבְדּוֹ        
            </Text>
            <Text fontSize={size}>
            אָז יָשִׁיר־משֶׁה וּבְנֵי יִשְׂרָאֵל אֶת־הַשִּׁירָה הַזֹּאת לַיהוָֹה וַיֹּאמְרוּ לֵאמֹר אָשִֽׁירָה לַיהוָֹה כִּי־גָאֹה גָּאָה סוּס וְרֹכְ֒בוֹ רָמָה בַיָּם: עָזִּי וְזִמְרָת יָהּ וַיְהִי־לִי לִישׁוּעָה זֶה אֵלִי וְאַנְוֵֽהוּ אֱלֹהֵי אָבִי וַאֲרֹמְ֒מֶֽנְהוּ: יְהֹוָה אִישׁ מִלְחָמָה יְהֹוָה שְׁמוֹ: מַרְכְּבֹת פַּרְעֹה וְחֵילוֹ יָרָה בַיָּם וּמִבְחַר שָׁלִשָׁיו טֻבְּ֒עוּ בְיַם־סוּף: תְּהֹמֹת יְכַסְיֻֽמוּ יָרְ֒דוּ בִמְצוֹלֹת כְּמוֹ־אָֽבֶן: יְמִינְ֒ךָ יְהֹוָה נֶאְדָּרִי בַּכֹּֽחַ יְמִֽינְ֒ךָ יְהֹוָה תִּרְעַץ אוֹיֵב: וּבְרֹב גְּאוֹנְ֒ךָ תַּהֲרֹס קָמֶֽיךָ תְּשַׁלַּח חֲרֹנְ֒ךָ יֹֽאכְ֒לֵמוֹ כַּקַּשׁ: וּבְרֽוּחַ אַפֶּֽיךָ נֶֽעֶרְמוּ מַֽיִם נִצְּ֒בוּ כְמוֹ־נֵד נֹזְ֒לִים קָפְ֒אוּ תְהֹמֹת בְּלֶב־יָם: אָמַר אוֹיֵב אֶרְדֹּף אַשִּׂיג אֲחַלֵּק שָׁלָל תִּמְלָאֵֽמוֹ נַפְשִׁי אָרִיק חַרְבִּי תּוֹרִישֵֽׁמוֹ יָדִי: נָשַֽׁפְתָּ בְרוּחֲךָ כִּסָּֽמוֹ יָם צָלֲלוּ כַּעוֹפֶֽרֶת בְּמַֽיִם אַדִּירִים: מִי־כָמֹֽכָה בָּאֵלִם יְהֹוָה מִי כָּמֹֽכָה נֶאְדָּר בַּקֹּֽדֶשׁ נוֹרָא תְהִלֹּת עֹֽשֵׂה־פֶֽלֶא: נָטִֽיתָ יְמִינְ֒ךָ תִּבְלָעֵֽמוֹ אָֽרֶץ: נָחִֽיתָ בְחַסְדְּ֒ךָ עַם־זוּ גָּאָֽלְתָּ נֵהַֽלְתָּ בְעָזְּ֒ךָ אֶל־נְוֵה קָדְשֶֽׁךָ: שָֽׁמְ֒עוּ עַמִּים יִרְגָּזוּן חִיל אָחַז ישְׁ֒בֵי פְּלָֽשֶׁת: אָז נִבְהֲלוּ אַלּוּפֵי אֱדוֹם אֵילֵי מוֹאָב יֹֽאחֲזֵֽמוֹ רָֽעַד נָמֹֽגוּ כֹּל ישְׁ֒בֵי כְנָֽעַן: תִּפֹּל עֲלֵיהֶם אֵימָֽתָה וָפַֽחַד בִּגְדֹל זְרוֹעֲךָ יִדְּ֒מוּ כָּאָֽבֶן עַד־יַֽעֲבֹר עַמְּ֒ךָ יְהֹוָה עַד־יַֽעֲבֹר עַם־זוּ קָנִֽיתָ: תְּבִאֵֽמוֹ וְתִטָּעֵֽמוֹ בְּהַר נַחֲלָתְ֒ךָ מָכוֹן לְשִׁבְתְּ֒ךָ פָּעַֽלְתָּ יְהֹוָה מִקְּ֒דָשׁ אֲדֹנָי כּוֹנְ֒נוּ יָדֶֽיךָ: יְהֹוָה יִמְלֹךְ לְעֹלָם וָעֶד: יְהֹוָה יִמְלֹךְ לְעֹלָם וָעֶד: יְהֹוָה מַלְכוּתֵהּ קָאֵים לְעָלַם וּלְעָלְ֒מֵי עָלְ֒מַיָּא: כִּי בָא סוּס פַּרְעֹה בְּרִכְבּוֹ וּבְפָרָשָׁיו בַּיָּם וַיָּֽשֶׁב יְהֹוָה עֲלֵהֶם אֶת־מֵי הַיָּם וּבְנֵי יִשְׂרָאֵל הָלְ֒כוּ בַיַּבָּשָׁה בְּתוֹךְ הַיָּֽם: כִּי לַיהוָֹה הַמְּ֒לוּכָה וּמשֵׁל בַּגּוֹיִם: וְעָלוּ מוֹשִׁעִים בְּהַר צִיּוֹן לִשְׁפֹּט אֶת־הַר עֵשָׂו, וְהָיְ֒תָה לַיהוָֹה הַמְּ֒לוּכָה: וְהָיָה יְהֹוָה לְמֶֽלֶךְ עַל־כָּל הָאָֽרֶץ בַּיּוֹם הַהוּא יִהְיֶה יְהֹוָה אֶחָד וּשְׁמוֹ אֶחָד   
            </Text>
        </Container>
    )
}

const Container = styled.div`
min-height: 50vh;
`;

const Heading = styled.h1`
text-align: right;
margin-right: 5vw;
font-family: 'Times New Roman', Georgia, serif;
`;

const Text = styled.div`
font-size: ${props => props.fontSize}px;
text-align: right;
margin-right: 5vw;
margin-left: 2vw;
margin-bottom: 5vh;
font-family: 'Times New Roman', Georgia, serif;
`;

export default AzYashir;